tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf67k40_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF67K40_H_
#define _PIC18LF67K40_H_

#define PPSLOCK                       0
#define PPSLOCKED                     1
#define INT0PPS0                      2
#define INT0PPS                       3
#define INT0PPS1                      4
#define INT0PPS2                      5
#define INT0PPS3                      6
#define INT0PPS4                      7
#define INT0PPS5                      8
#define INT1PPS                       9
#define INT1PPS0                      10
#define INT1PPS1                      11
#define INT1PPS2                      12
#define INT1PPS3                      13
#define INT1PPS4                      14
#define INT1PPS5                      15
#define INT2PPS0                      16
#define INT2PPS                       17
#define INT2PPS1                      18
#define INT2PPS2                      19
#define INT2PPS3                      20
#define INT2PPS4                      21
#define INT2PPS5                      22
#define INT3PPS0                      23
#define INT3PPS                       24
#define INT3PPS1                      25
#define INT3PPS2                      26
#define INT3PPS3                      27
#define INT3PPS4                      28
#define INT3PPS5                      29
#define T0CKIPPS0                     30
#define T0CKIPPS                      31
#define T0CKIPPS1                     32
#define T0CKIPPS2                     33
#define T0CKIPPS3                     34
#define T0CKIPPS4                     35
#define T0CKIPPS5                     36
#define T1CKIPPS0                     37
#define T1CKIPPS                      38
#define T1CKIPPS1                     39
#define T1CKIPPS2                     40
#define T1CKIPPS3                     41
#define T1CKIPPS4                     42
#define T1CKIPPS5                     43
#define T1GPPS0                       44
#define T1GPPS                        45
#define T1GPPS1                       46
#define T1GPPS2                       47
#define T1GPPS3                       48
#define T1GPPS4                       49
#define T1GPPS5                       50
#define T3CKIPPS0                     51
#define T3CKIPPS                      52
#define T3CKIPPS1                     53
#define T3CKIPPS2                     54
#define T3CKIPPS3                     55
#define T3CKIPPS4                     56
#define T3CKIPPS5                     57
#define T3GPPS0                       58
#define T3GPPS                        59
#define T3GPPS1                       60
#define T3GPPS2                       61
#define T3GPPS3                       62
#define T3GPPS4                       63
#define T3GPPS5                       64
#define T5CKIPPS0                     65
#define T5CKIPPS                      66
#define T5CKIPPS1                     67
#define T5CKIPPS2                     68
#define T5CKIPPS3                     69
#define T5CKIPPS4                     70
#define T5CKIPPS5                     71
#define T5GPPS                        72
#define T5GPPS0                       73
#define T5GPPS1                       74
#define T5GPPS2                       75
#define T5GPPS3                       76
#define T5GPPS4                       77
#define T5GPPS5                       78
#define T7CKIPPS                      79
#define T7CKIPPS0                     80
#define T7CKIPPS1                     81
#define T7CKIPPS2                     82
#define T7CKIPPS3                     83
#define T7CKIPPS4                     84
#define T7CKIPPS5                     85
#define T7GPPS0                       86
#define T7GPPS                        87
#define T7GPPS1                       88
#define T7GPPS2                       89
#define T7GPPS3                       90
#define T7GPPS4                       91
#define T7GPPS5                       92
#define T2INPPS                       93
#define T2INPPS0                      94
#define T2INPPS1                      95
#define T2INPPS2                      96
#define T2INPPS3                      97
#define T2INPPS4                      98
#define T2INPPS5                      99
#define T4INPPS0                      100
#define T4INPPS                       101
#define T4INPPS1                      102
#define T4INPPS2                      103
#define T4INPPS3                      104
#define T4INPPS4                      105
#define T4INPPS5                      106
#define T6INPPS0                      107
#define T6INPPS                       108
#define T6INPPS1                      109
#define T6INPPS2                      110
#define T6INPPS3                      111
#define T6INPPS4                      112
#define T6INPPS5                      113
#define T8INPPS0                      114
#define T8INPPS                       115
#define T8INPPS1                      116
#define T8INPPS2                      117
#define T8INPPS3                      118
#define T8INPPS4                      119
#define T8INPPS5                      120
#define ADACTPPS                      121
#define ADACTPPS0                     122
#define ADACTPPS1                     123
#define ADACTPPS2                     124
#define ADACTPPS3                     125
#define ADACTPPS4                     126
#define ADACTPPS5                     127
#define CCP1PPS0                      128
#define CCP1PPS                       129
#define CCP1PPS1                      130
#define CCP1PPS2                      131
#define CCP1PPS3                      132
#define CCP1PPS4                      133
#define CCP1PPS5                      134
#define CCP2PPS0                      135
#define CCP2PPS                       136
#define CCP2PPS1                      137
#define CCP2PPS2                      138
#define CCP2PPS3                      139
#define CCP2PPS4                      140
#define CCP2PPS5                      141
#define CCP3PPS0                      142
#define CCP3PPS                       143
#define CCP3PPS1                      144
#define CCP3PPS2                      145
#define CCP3PPS3                      146
#define CCP3PPS4                      147
#define CCP3PPS5                      148
#define CCP4PPS0                      149
#define CCP4PPS                       150
#define CCP4PPS1                      151
#define CCP4PPS2                      152
#define CCP4PPS3                      153
#define CCP4PPS4                      154
#define CCP4PPS5                      155
#define CCP5PPS                       156
#define CCP5PPS0                      157
#define CCP5PPS1                      158
#define CCP5PPS2                      159
#define CCP5PPS3                      160
#define CCP5PPS4                      161
#define CCP5PPS5                      162
#define SMT1WINPPS                    163
#define SMT1WINPPS0                   164
#define SMT1WINPPS1                   165
#define SMT1WINPPS2                   166
#define SMT1WINPPS3                   167
#define SMT1WINPPS4                   168
#define SMT1WINPPS5                   169
#define SMT1SIGPPS                    170
#define SMT1SIGPPS0                   171
#define SMT1SIGPPS1                   172
#define SMT1SIGPPS2                   173
#define SMT1SIGPPS3                   174
#define SMT1SIGPPS4                   175
#define SMT1SIGPPS5                   176
#define SMT2WINPPS0                   177
#define SMT2WINPPS                    178
#define SMT2WINPPS1                   179
#define SMT2WINPPS2                   180
#define SMT2WINPPS3                   181
#define SMT2WINPPS4                   182
#define SMT2WINPPS5                   183
#define SMT2SIGPPS                    184
#define SMT2SIGPPS0                   185
#define SMT2SIGPPS1                   186
#define SMT2SIGPPS2                   187
#define SMT2SIGPPS3                   188
#define SMT2SIGPPS4                   189
#define SMT2SIGPPS5                   190
#define CWGINPPS                      191
#define CWGINPPS0                     192
#define CWG1INPPS0                    193
#define CWG1INPPS                     194
#define CWGINPPS1                     195
#define CWG1INPPS1                    196
#define CWGINPPS2                     197
#define CWG1INPPS2                    198
#define CWGINPPS3                     199
#define CWG1INPPS3                    200
#define CWGINPPS4                     201
#define CWG1INPPS4                    202
#define CWGINPPS5                     203
#define CWG1INPPS5                    204
#define MDCARLPPS                     205
#define MDCARLPPS0                    206
#define MDCARLPPS1                    207
#define MDCARLPPS2                    208
#define MDCARLPPS3                    209
#define MDCARLPPS4                    210
#define MDCARLPPS5                    211
#define MDCARHPPS0                    212
#define MDCARHPPS                     213
#define MDCARHPPS1                    214
#define MDCARHPPS2                    215
#define MDCARHPPS3                    216
#define MDCARHPPS4                    217
#define MDCARHPPS5                    218
#define MDSRCPPS0                     219
#define MDSRCPPS                      220
#define MDSRCPPS1                     221
#define MDSRCPPS2                     222
#define MDSRCPPS3                     223
#define MDSRCPPS4                     224
#define MDSRCPPS5                     225
#define RX1PPS0                       226
#define RX1PPS                        227
#define RX1PPS1                       228
#define RX1PPS2                       229
#define RX1PPS3                       230
#define RX1PPS4                       231
#define RX1PPS5                       232
#define TX1PPS0                       233
#define TX1PPS                        234
#define TX1PPS1                       235
#define TX1PPS2                       236
#define TX1PPS3                       237
#define TX1PPS4                       238
#define TX1PPS5                       239
#define RX2PPS0                       240
#define RX2PPS                        241
#define RX2PPS1                       242
#define RX2PPS2                       243
#define RX2PPS3                       244
#define RX2PPS4                       245
#define RX2PPS5                       246
#define TX2PPS                        247
#define TX2PPS0                       248
#define TX2PPS1                       249
#define TX2PPS2                       250
#define TX2PPS3                       251
#define TX2PPS4                       252
#define TX2PPS5                       253
#define RX3PPS0                       254
#define RX3PPS                        255
#define RX3PPS1                       256
#define RX3PPS2                       257
#define RX3PPS3                       258
#define RX3PPS4                       259
#define RX3PPS5                       260
#define TX3PPS                        261
#define TX3PPS0                       262
#define TX3PPS1                       263
#define TX3PPS2                       264
#define TX3PPS3                       265
#define TX3PPS4                       266
#define TX3PPS5                       267
#define RX4PPS                        268
#define RX4PPS0                       269
#define RX4PPS1                       270
#define RX4PPS2                       271
#define RX4PPS3                       272
#define RX4PPS4                       273
#define RX4PPS5                       274
#define TX4PPS0                       275
#define TX4PPS                        276
#define TX4PPS1                       277
#define TX4PPS2                       278
#define TX4PPS3                       279
#define TX4PPS4                       280
#define TX4PPS5                       281
#define RX5PPS                        282
#define RX5PPS0                       283
#define RX5PPS1                       284
#define RX5PPS2                       285
#define RX5PPS3                       286
#define RX5PPS4                       287
#define RX5PPS5                       288
#define TX5PPS0                       289
#define TX5PPS                        290
#define TX5PPS1                       291
#define TX5PPS2                       292
#define TX5PPS3                       293
#define TX5PPS4                       294
#define TX5PPS5                       295
#define SSP1CLKPPS0                   296
#define SSP1CLKPPS                    297
#define SSP1CLKPPS1                   298
#define SSP1CLKPPS2                   299
#define SSP1CLKPPS3                   300
#define SSP1CLKPPS4                   301
#define SSP1CLKPPS5                   302
#define SSP1DATPPS0                   303
#define SSP1DATPPS                    304
#define SSP1DATPPS1                   305
#define SSP1DATPPS2                   306
#define SSP1DATPPS3                   307
#define SSP1DATPPS4                   308
#define SSP1DATPPS5                   309
#define SSP1SSPPS                     310
#define SSP1SSPPS0                    311
#define SSP1SSPPS1                    312
#define SSP1SSPPS2                    313
#define SSP1SSPPS3                    314
#define SSP1SSPPS4                    315
#define SSP1SSPPS5                    316
#define SSP2CLKPPS                    317
#define SSP2CLKPPS0                   318
#define SSP2CLKPPS1                   319
#define SSP2CLKPPS2                   320
#define SSP2CLKPPS3                   321
#define SSP2CLKPPS4                   322
#define SSP2CLKPPS5                   323
#define SSP2DATPPS                    324
#define SSP2DATPPS0                   325
#define SSP2DATPPS1                   326
#define SSP2DATPPS2                   327
#define SSP2DATPPS3                   328
#define SSP2DATPPS4                   329
#define SSP2DATPPS5                   330
#define SSP2SSPPS                     331
#define SSP2SSPPS0                    332
#define SSP2SSPPS1                    333
#define SSP2SSPPS2                    334
#define SSP2SSPPS3                    335
#define SSP2SSPPS4                    336
#define SSP2SSPPS5                    337
#define IPR0                          338
#define INT0IP                        339
#define INT1IP                        340
#define INT2IP                        341
#define INT3IP                        342
#define IOCIP                         343
#define TMR0IP                        344
#define IPR1                          345
#define ADIP                          346
#define ADTIP                         347
#define CSWIP                         348
#define OSCFIP                        349
#define PSPIP                         350
#define IPR2                          351
#define C1IP                          352
#define C2IP                          353
#define C3IP                          354
#define ZCDIP                         355
#define CMIP                          356
#define HLVDIP                        357
#define IPR3                          358
#define SSP1IP                        359
#define BCL1IP                        360
#define RXBNIP                        361
#define SSP2IP                        362
#define BCL2IP                        363
#define TX1IP                         364
#define TXBNIP                        365
#define RC1IP                         366
#define TX2IP                         367
#define RC2IP                         368
#define IPR4                          369
#define CCIP3IP                       370
#define TX3IP                         371
#define RC3IP                         372
#define TX4IP                         373
#define RC4IP                         374
#define TX5IP                         375
#define RC5IP                         376
#define IPR5                          377
#define CCH05                         378
#define TMR1IP                        379
#define CCH15                         380
#define TMR2IP                        381
#define TMR3IP                        382
#define EVPOL05                       383
#define TMR4IP                        384
#define EVPOL15                       385
#define TMR5IP                        386
#define TMR6IP                        387
#define TMR7IP                        388
#define TMR8IP                        389
#define IPR6                          390
#define TMR1GIP                       391
#define TMR3GIP                       392
#define TMR5GIP                       393
#define TMR7GIP                       394
#define IPR7                          395
#define CCP1IP                        396
#define CCP2IP                        397
#define CCP3IP                        398
#define CCP4IP                        399
#define CCP5IP                        400
#define IPR8                          401
#define CWG1IP                        402
#define NVMIP                         403
#define CRCIP                         404
#define SCANIP                        405
#define IPR9                          406
#define SMU1IP                        407
#define SMU1PRAIP                     408
#define SMU1PWAIP                     409
#define SMU2IP                        410
#define SMU2PRAIP                     411
#define SMU2PWAIP                     412
#define PIE0                          413
#define INT0IE                        414
#define INT1IE                        415
#define INT2IE                        416
#define INT3IE                        417
#define IOCIE                         418
#define TMR0IE                        419
#define PIE1                          420
#define ADIE                          421
#define ADTIE                         422
#define CSWIE                         423
#define OSCFIE                        424
#define PSPIE                         425
#define PIE2                          426
#define C1IE                          427
#define C2IE                          428
#define C3IE                          429
#define ZCDIE                         430
#define CMIE                          431
#define HLVDIE                        432
#define PIE3                          433
#define SSP1IE                        434
#define RXB0IE                        435
#define BCL1IE                        436
#define RXBNIE                        437
#define RXB1IE                        438
#define SSP2IE                        439
#define TXB0IE                        440
#define BCL2IE                        441
#define TXB1IE                        442
#define TXBNIE                        443
#define TXB2IE                        444
#define TX1IE                         445
#define RC1IE                         446
#define TX2IE                         447
#define RC2IE                         448
#define PIE4                          449
#define TX3IE                         450
#define RC3IE                         451
#define TX4IE                         452
#define RC4IE                         453
#define TX5IE                         454
#define RC5IE                         455
#define PIE5                          456
#define TMR1IE                        457
#define TMR2IE                        458
#define TMR3IE                        459
#define TMR4IE                        460
#define TMR5IE                        461
#define TMR6IE                        462
#define TMR7IE                        463
#define TMR8IE                        464
#define PIE6                          465
#define TMR1GIE                       466
#define TMR3GIE                       467
#define TMR5GIE                       468
#define TMR7GIE                       469
#define PIE7                          470
#define CCP1IE                        471
#define CCP2IE                        472
#define CCP3IE                        473
#define CCP4IE                        474
#define CCP5IE                        475
#define PIE8                          476
#define CWG1IE                        477
#define NVMIE                         478
#define CRCIE                         479
#define SCANIE                        480
#define PIE9                          481
#define SMU1IE                        482
#define SMU1PRAIE                     483
#define SMU1PWAIE                     484
#define SMU2IE                        485
#define SMU2PRAIE                     486
#define SMU2PWAIE                     487
#define PIR0                          488
#define INT0IF                        489
#define INT1IF                        490
#define INT2IF                        491
#define INT3IF                        492
#define IOCIF                         493
#define TMR0IF                        494
#define PIR1                          495
#define ADIF                          496
#define ADTIF                         497
#define CSWIF                         498
#define OSCFIF                        499
#define PSPIF                         500
#define PIR2                          501
#define C1IF                          502
#define C2IF                          503
#define C3IF                          504
#define ZCDIF                         505
#define CMIF                          506
#define HLVDIF                        507
#define PIR3                          508
#define SSP1IF                        509
#define RXBNIF                        510
#define BCL1IF                        511
#define SSP2IF                        512
#define BCL2IF                        513
#define TXBNIF                        514
#define TX1IF                         515
#define RC1IF                         516
#define TX2IF                         517
#define RC2IF                         518
#define PIR4                          519
#define TX3IF                         520
#define RC3IF                         521
