tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf67k40_tdd.h
#define TX4IF                         522
#define RC4IF                         523
#define TX5IF                         524
#define RC5IF                         525
#define PIR5                          526
#define TMR1IF                        527
#define TMR2IF                        528
#define TMR3IF                        529
#define TMR4IF                        530
#define TMR5IF                        531
#define TMR6IF                        532
#define TMR7IF                        533
#define TMR8IF                        534
#define PIR6                          535
#define TMR1GIF                       536
#define TMR3GIF                       537
#define TMR5GIF                       538
#define TMR7GIF                       539
#define PIR7                          540
#define CCP1IF                        541
#define CCP2IF                        542
#define CCP3IF                        543
#define CCP4IF                        544
#define CCP5IF                        545
#define PIR8                          546
#define NVMIF                         547
#define CRCIF                         548
#define SCANIF                        549
#define PIR9                          550
#define SMU1IF                        551
#define SMU1PRAIF                     552
#define SMU1PWAIF                     553
#define SMU2IF                        554
#define SMU2PRAIF                     555
#define SMU2PWAIF                     556
#define WDTCON0                       557
#define WDTCON0_SEN                   558
#define SWDTEN                        559
#define WDTSEN                        560
#define PS                            561
#define WDTPS                         562
#define WDTPS0                        563
#define PS0                           564
#define WDTPS1                        565
#define PS1                           566
#define WDTPS2                        567
#define PS2                           568
#define WDTPS3                        569
#define PS3                           570
#define WDTPS4                        571
#define PS4                           572
#define WDTCON1                       573
#define WDTWINDOW0                    574
#define WINDOW0                       575
#define WINDOW                        576
#define WDTWINDOW                     577
#define WDTWINDOW1                    578
#define WINDOW1                       579
#define WDTWINDOW2                    580
#define WINDOW2                       581
#define WDTCS                         582
#define WDTCON1_CS0                   583
#define WDTCON1_CS                    584
#define WDTCS0                        585
#define WDTCON1_CS1                   586
#define WDTCS1                        587
#define WDTCON1_CS2                   588
#define WDTCS2                        589
#define WDTL                          590
#define WDT0                          591
#define WDT1                          592
#define WDT2                          593
#define WDT3                          594
#define WDT4                          595
#define WDT5                          596
#define WDT6                          597
#define WDT7                          598
#define WDTH                          599
#define WDT8                          600
#define WDT9                          601
#define WDT10                         602
#define WDT11                         603
#define WDT12                         604
#define WDT13                         605
#define WDT14                         606
#define WDT15                         607
#define WDTU                          608
#define WDTPSCNT16                    609
#define WDT16                         610
#define PSCNT16                       611
#define WDTPSCNT                      612
#define WDTPSCNT17                    613
#define WDT17                         614
#define PSCNT17                       615
#define WDTPSCNT18                    616
#define WDTSTATE                      617
#define PSCNT18                       618
#define WDTPSCNT19                    619
#define WDT18                         620
#define PSCNT19                       621
#define PSCNT20                       622
#define WDT19                         623
#define WDTPSCNT20                    624
#define PSCNT21                       625
#define WDTPSCNT21                    626
#define WDT20                         627
#define PSCNT22                       628
#define WDT21                         629
#define WDTPSCNT22                    630
#define WDT22                         631
#define CPUDOZE                       632
#define DOZE0                         633
#define DOZE                          634
#define DOZE1                         635
#define DOZE2                         636
#define DOE                           637
#define ROI                           638
#define DOZEN                         639
#define IDLEN                         640
#define OSCCON1                       641
#define NDIV0                         642
#define NDIV                          643
#define NDIV1                         644
#define NDIV2                         645
#define NDIV3                         646
#define NOSC0                         647
#define NOSC                          648
#define NOSC1                         649
#define NOSC2                         650
#define OSCCON2                       651
#define CDIV0                         652
#define CDIV                          653
#define CDIV1                         654
#define CDIV2                         655
#define CDIV3                         656
#define COSC                          657
#define COSC0                         658
#define COSC1                         659
#define COSC2                         660
#define OSCCON3                       661
#define NOSCR                         662
#define ORDY                          663
#define SOSCPWR                       664
#define CSWHOLD                       665
#define OSCSTAT                       666
#define PLLR                          667
#define ADOR                          668
#define SOR                           669
#define LFOR                          670
#define MFOR                          671
#define HFOR                          672
#define EXTOR                         673
#define OSCEN                         674
#define ADOEN                         675
#define SOSCEN                        676
#define LFOEN                         677
#define MFOEN                         678
#define HFOEN                         679
#define EXTOEN                        680
#define OSCTUNE                       681
#define TUN0                          682
#define TUN                           683
#define TUN1                          684
#define TUN2                          685
#define TUN3                          686
#define TUN4                          687
#define TUN5                          688
#define OSCFRQ                        689
#define HFFRQ                         690
#define FRQ0                          691
#define FRQ1                          692
#define FRQ2                          693
#define FRQ3                          694
#define BORCON                        695
#define BORRDY                        696
#define SBOREN                        697
#define PMD0                          698
#define IOCMD                         699
#define CLKRMD                        700
#define SPI1MD                        701
#define SPI2MD                        702
#define NVMMD                         703
#define SCANMD                        704
#define CRCMD                         705
#define HLVDMD                        706
#define FVRMD                         707
#define SYSCMD                        708
#define PMD1                          709
#define EMBMD                         710
#define TMR0MD                        711
#define TMR1MD                        712
#define TMR2MD                        713
#define TMR3MD                        714
#define TMR4MD                        715
#define TMR5MD                        716
#define TMR6MD                        717
#define TMR7MD                        718
#define PMD2                          719
#define TMR8MD                        720
#define SMU1MD                        721
#define SMU2MD                        722
#define DSMMD                         723
#define CWGMD                         724
#define CWG1MD                        725
#define PMD3                          726
#define ZCDMD                         727
#define CMP1MD                        728
#define CMP2MD                        729
#define CMP3MD                        730
#define ADCMD                         731
#define DACMD                         732
#define PMD4                          733
#define CCP1MD                        734
#define CCP2MD                        735
#define CCP3MD                        736
#define CCP4MD                        737
#define CCP5MD                        738
#define PWM6MD                        739
#define PWM7MD                        740
#define PMD5                          741
#define MSSP1MD                       742
#define MSSP2MD                       743
#define UART1MD                       744
#define UART2MD                       745
#define UART3MD                       746
#define UART4MD                       747
#define UART5MD                       748
#define RA0PPS                        749
#define RA0PPS0                       750
#define RA0PPS1                       751
#define RA0PPS2                       752
#define RA0PPS3                       753
#define RA0PPS4                       754
#define RA0PPS5                       755
#define RA1PPS                        756
#define RA1PPS0                       757
#define RA1PPS1                       758
#define RA1PPS2                       759
#define RA1PPS3                       760
#define RA1PPS4                       761
#define RA1PPS5                       762
#define RA2PPS                        763
#define RA2PPS0                       764
#define RA2PPS1                       765
#define RA2PPS2                       766
#define RA2PPS3                       767
#define RA2PPS4                       768
#define RA2PPS5                       769
#define RA3PPS                        770
#define RA3PPS0                       771
#define RA3PPS1                       772
#define RA3PPS2                       773
#define RA3PPS3                       774
#define RA3PPS4                       775
#define RA3PPS5                       776
#define RA4PPS                        777
#define RA4PPS0                       778
#define RA4PPS1                       779
#define RA4PPS2                       780
#define RA4PPS3                       781
#define RA4PPS4                       782
#define RA4PPS5                       783
#define RA5PPS                        784
#define RA5PPS0                       785
#define RA5PPS1                       786
#define RA5PPS2                       787
#define RA5PPS3                       788
#define RA5PPS4                       789
#define RA5PPS5                       790
#define RA6PPS                        791
#define RA6PPS0                       792
#define RA6PPS1                       793
#define RA6PPS2                       794
#define RA6PPS3                       795
#define RA6PPS4                       796
#define RA6PPS5                       797
#define RA7PPS                        798
#define RA7PPS0                       799
#define RA7PPS1                       800
#define RA7PPS2                       801
#define RA7PPS3                       802
#define RA7PPS4                       803
#define RA7PPS5                       804
#define RB0PPS                        805
#define RB0PPS0                       806
#define RB0PPS1                       807
#define RB0PPS2                       808
#define RB0PPS3                       809
#define RB0PPS4                       810
#define RB0PPS5                       811
#define RB1PPS                        812
#define RB1PPS0                       813
#define RB1PPS1                       814
#define RB1PPS2                       815
#define RB1PPS3                       816
#define RB1PPS4                       817
#define RB1PPS5                       818
#define RB2PPS                        819
#define RB2PPS0                       820
#define RB2PPS1                       821
#define RB2PPS2                       822
#define RB2PPS3                       823
#define RB2PPS4                       824
#define RB2PPS5                       825
#define RB3PPS                        826
#define RB3PPS0                       827
#define RB3PPS1                       828
#define RB3PPS2                       829
#define RB3PPS3                       830
#define RB3PPS4                       831
#define RB3PPS5                       832
#define RB4PPS                        833
#define RB4PPS0                       834
#define RB4PPS1                       835
#define RB4PPS2                       836
#define RB4PPS3                       837
#define RB4PPS4                       838
#define RB4PPS5                       839
#define RB5PPS                        840
#define RB5PPS0                       841
#define RB5PPS1                       842
#define RB5PPS2                       843
#define RB5PPS3                       844
#define RB5PPS4                       845
#define RB5PPS5                       846
#define RB6PPS                        847
#define RB6PPS0                       848
#define RB6PPS1                       849
#define RB6PPS2                       850
#define RB6PPS3                       851
#define RB6PPS4                       852
#define RB6PPS5                       853
#define RB7PPS                        854
#define RB7PPS0                       855
#define RB7PPS1                       856
#define RB7PPS2                       857
#define RB7PPS3                       858
#define RB7PPS4                       859
#define RB7PPS5                       860
#define RC0PPS                        861
#define RC0PPS0                       862
#define RC0PPS1                       863
#define RC0PPS2                       864
#define RC0PPS3                       865
#define RC0PPS4                       866
#define RC0PPS5                       867
#define RC1PPS                        868
#define RC1PPS0                       869
#define RC1PPS1                       870
#define RC1PPS2                       871
#define RC1PPS3                       872
#define RC1PPS4                       873
#define RC1PPS5                       874
#define RC2PPS                        875
#define RC2PPS0                       876
#define RC2PPS1                       877
#define RC2PPS2                       878
#define RC2PPS3                       879
#define RC2PPS4                       880
#define RC2PPS5                       881
#define RC3PPS                        882
#define RC3PPS0                       883
#define RC3PPS1                       884
#define RC3PPS2                       885
#define RC3PPS3                       886
#define RC3PPS4                       887
#define RC3PPS5                       888
#define RC4PPS                        889
#define RC4PPS0                       890
#define RC4PPS1                       891
#define RC4PPS2                       892
#define RC4PPS3                       893
#define RC4PPS4                       894
#define RC4PPS5                       895
#define RC5PPS                        896
#define RC5PPS0                       897
#define RC5PPS1                       898
#define RC5PPS2                       899
#define RC5PPS3                       900
#define RC5PPS4                       901
#define RC5PPS5                       902
#define RC6PPS                        903
#define RC6PPS0                       904
#define RC6PPS1                       905
#define RC6PPS2                       906
#define RC6PPS3                       907
#define RC6PPS4                       908
#define RC6PPS5                       909
#define RC7PPS                        910
#define RC7PPS0                       911
#define RC7PPS1                       912
#define RC7PPS2                       913
#define RC7PPS3                       914
#define RC7PPS4                       915
#define RC7PPS5                       916
#define RD0PPS                        917
#define RD0PPS0                       918
#define RD0PPS1                       919
#define RD0PPS2                       920
#define RD0PPS3                       921
#define RD0PPS4                       922
#define RD0PPS5                       923
#define RD1PPS                        924
#define RD1PPS0                       925
#define RD1PPS1                       926
#define RD1PPS2                       927
#define RD1PPS3                       928
#define RD1PPS4                       929
#define RD1PPS5                       930
#define RD2PPS                        931
#define RD2PPS0                       932
#define RD2PPS1                       933
#define RD2PPS2                       934
#define RD2PPS3                       935
#define RD2PPS4                       936
#define RD2PPS5                       937
#define RD3PPS                        938
#define RD3PPS0                       939
#define RD3PPS1                       940
#define RD3PPS2                       941
#define RD3PPS3                       942
#define RD3PPS4                       943
#define RD3PPS5                       944
#define RD4PPS                        945
#define RD4PPS0                       946
#define RD4PPS1                       947
#define RD4PPS2                       948
#define RD4PPS3                       949
#define RD4PPS4                       950
#define RD4PPS5                       951
#define RD5PPS                        952
#define RD5PPS0                       953
#define RD5PPS1                       954
#define RD5PPS2                       955
#define RD5PPS3                       956
#define RD5PPS4                       957
#define RD5PPS5                       958
#define RD6PPS                        959
#define RD6PPS0                       960
#define RD6PPS1                       961
#define RD6PPS2                       962
#define RD6PPS3                       963
#define RD6PPS4                       964
#define RD6PPS5                       965
#define RD7PPS                        966
#define RD7PPS0                       967
#define RD7PPS1                       968
#define RD7PPS2                       969
#define RD7PPS3                       970
#define RD7PPS4                       971
#define RD7PPS5                       972
#define RE0PPS                        973
#define RE0PPS0                       974
#define RE0PPS1                       975
#define RE0PPS2                       976
#define RE0PPS3                       977
#define RE0PPS4                       978
#define RE0PPS5                       979
#define RE1PPS                        980
#define RE1PPS0                       981
#define RE1PPS1                       982
#define RE1PPS2                       983
#define RE1PPS3                       984
#define RE1PPS4                       985
#define RE1PPS5                       986
#define RE2PPS                        987
#define RE2PPS0                       988
#define RE2PPS1                       989
#define RE2PPS2                       990
#define RE2PPS3                       991
#define RE2PPS4                       992
#define RE2PPS5                       993
#define RE3PPS                        994
#define RE3PPS0                       995
#define RE3PPS1                       996
#define RE3PPS2                       997
#define RE3PPS3                       998
#define RE3PPS4                       999
#define RE3PPS5                       1000
#define RE4PPS                        1001
#define RE4PPS0                       1002
#define RE4PPS1                       1003
#define RE4PPS2                       1004
#define RE4PPS3                       1005
#define RE4PPS4                       1006
#define RE4PPS5                       1007
#define RE5PPS                        1008
#define RE5PPS0                       1009
#define RE5PPS1                       1010
#define RE5PPS2                       1011
#define RE5PPS3                       1012
#define RE5PPS4                       1013
#define RE5PPS5                       1014
#define RE6PPS                        1015
#define RE6PPS0                       1016
#define RE6PPS1                       1017
#define RE6PPS2                       1018
#define RE6PPS3                       1019
#define RE6PPS4                       1020
#define RE6PPS5                       1021
#define RE7PPS                        1022
#define RE7PPS0                       1023
#define RE7PPS1                       1024
#define RE7PPS2                       1025
#define RE7PPS3                       1026
#define RE7PPS4                       1027
#define RE7PPS5                       1028
#define RF0PPS                        1029
#define RF0PPS0                       1030
#define RF0PPS1                       1031
#define RF0PPS2                       1032
#define RF0PPS3                       1033
#define RF0PPS4                       1034
#define RF0PPS5                       1035
#define RF1PPS                        1036
#define RF1PPS0                       1037
#define RF1PPS1                       1038
#define RF1PPS2                       1039
#define RF1PPS3                       1040
#define RF1PPS4                       1041
#define RF1PPS5                       1042
#define RF2PPS                        1043
#define RF2PPS0                       1044
#define RF2PPS1                       1045
#define RF2PPS2                       1046
#define RF2PPS3                       1047
#define RF2PPS4                       1048
#define RF2PPS5                       1049
#define RF3PPS                        1050
#define RF3PPS0                       1051
#define RF3PPS1                       1052
#define RF3PPS2                       1053
#define RF3PPS3                       1054
#define RF3PPS4                       1055
#define RF3PPS5                       1056
#define RF4PPS                        1057
#define RF4PPS0                       1058
#define RF4PPS1                       1059
#define RF4PPS2                       1060
#define RF4PPS3                       1061
#define RF4PPS4                       1062
#define RF4PPS5                       1063
#define RF5PPS                        1064
#define RF5PPS0                       1065
#define RF5PPS1                       1066
#define RF5PPS2                       1067
#define RF5PPS3                       1068
#define RF5PPS4                       1069
#define RF5PPS5                       1070
#define RF6PPS                        1071
#define RF6PPS0                       1072
#define RF6PPS1                       1073
#define RF6PPS2                       1074
#define RF6PPS3                       1075
#define RF6PPS4                       1076
#define RF6PPS5                       1077
#define RF7PPS                        1078
#define RF7PPS0                       1079
#define RF7PPS1                       1080
#define RF7PPS2                       1081
#define RF7PPS3                       1082
#define RF7PPS4                       1083
#define RF7PPS5                       1084
#define RG0PPS                        1085
#define RG0PPS0                       1086
#define RG0PPS1                       1087
#define RG0PPS2                       1088
#define RG0PPS3                       1089
#define RG0PPS4                       1090
