tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf67k40_tdd.h
#define PEN1                          3881
#define SSP1CON2_ADMSK2               3882
#define ADMSK31                       3883
#define RCEN1                         3884
#define SSP1CON2_RCEN                 3885
#define SSP1CON2_ADMSK3               3886
#define SSP1CON2_ACKEN                3887
#define ACKEN1                        3888
#define ADMSK41                       3889
#define SSP1CON2_ADMSK4               3890
#define ACKDT1                        3891
#define ADMSK51                       3892
#define SSP1CON2_ACKDT                3893
#define SSP1CON2_ADMSK5               3894
#define SSP1CON2_ACKSTAT              3895
#define ACKSTAT1                      3896
#define GCEN1                         3897
#define SSP1CON2_GCEN                 3898
#define SSP1CON3                      3899
#define SSP1CON3_DHEN                 3900
#define SSP1CON3_AHEN                 3901
#define SSP1CON3_SBCDE                3902
#define SSP1CON3_SDAHT                3903
#define SSP1CON3_BOEN                 3904
#define SSP1CON3_SCIE                 3905
#define SSP1CON3_PCIE                 3906
#define SSP1CON3_ACKTIM               3907
#define RC1REG                        3908
#define TX1REG                        3909
#define SP1BRGL                       3910
#define SP1BRGH                       3911
#define RC1STA                        3912
#define RC1STA_RX9D                   3913
#define RCD8                          3914
#define RC1STA_OERR                   3915
#define RC1STA_FERR                   3916
#define RC1STA_ADDEN                  3917
#define RC1STA_CREN                   3918
#define RC1STA_SREN                   3919
#define RC1STA_RX9                    3920
#define RC8_9                         3921
#define RC9                           3922
#define RC1STA_SPEN                   3923
#define TX1STA                        3924
#define TXD8                          3925
#define TX1STA_TX9D                   3926
#define TX1STA_TRMT                   3927
#define TX1STA_BRGH                   3928
#define TX1STA_SENDB                  3929
#define TX1STA_SYNC                   3930
#define TX1STA_TXEN                   3931
#define TX1STA_TX9                    3932
#define TX8_9                         3933
#define TX1STA_CSRC                   3934
#define BAUD1CON                      3935
#define ABDEN1                        3936
#define BAUD1CON_ABDEN                3937
#define WUE1                          3938
#define BAUD1CON_WUE                  3939
#define BRG161                        3940
#define BAUD1CON_BRG16                3941
#define SCKP1                         3942
#define CKTXP                         3943
#define TXCKP                         3944
#define BAUD1CON_SCKP                 3945
#define TXCKP1                        3946
#define BAUD1CON_RCIDL                3947
#define RCMT1                         3948
#define RCIDL1                        3949
#define RCMT                          3950
#define BAUD1CON_ABDOVF               3951
#define ABDOVF1                       3952
#define PWM7DCL                       3953
#define PWM7DCL_PWMPW0                3954
#define PWM7DC0                       3955
#define PWM7DCL_DC                    3956
#define PWM7DCL_DC0                   3957
#define PWM7DCL_PWMPW1                3958
#define PWM7DC1                       3959
#define PWM7DCL_DC1                   3960
#define PWM7DCH                       3961
#define PWM7DCH_DC2                   3962
#define PWM7DCH_DC                    3963
#define PWM7DC2                       3964
#define PWM7DCH_PWMPW2                3965
#define PWM7DCH_PWMPW3                3966
#define PWM7DCH_DC3                   3967
#define PWM7DC3                       3968
#define PWM7DCH_PWMPW4                3969
#define PWM7DCH_DC4                   3970
#define PWM7DC4                       3971
#define PWM7DCH_PWMPW5                3972
#define PWM7DCH_DC5                   3973
#define PWM7DC5                       3974
#define PWM7DCH_DC6                   3975
#define PWM7DC6                       3976
#define PWM7DCH_PWMPW6                3977
#define PWM7DCH_DC7                   3978
#define PWM7DC7                       3979
#define PWM7DCH_PWMPW7                3980
#define PWM7DCH_DC8                   3981
#define PWM7DCH_PWMPW8                3982
#define PWM7DC8                       3983
#define PWM7DCH_DC9                   3984
#define PWM7DCH_PWMPW9                3985
#define PWM7DC9                       3986
#define PWM7CON                       3987
#define PWM7POL                       3988
#define PWM7CON_POL                   3989
#define PWM7CON_OUT                   3990
#define PWM7OUT                       3991
#define PWM7CON_OE                    3992
#define PWM7OE                        3993
#define PWM7EN                        3994
#define PWM7CON_EN                    3995
#define PWM6DCL                       3996
#define PWM6DCL_DC                    3997
#define PWM6DCL_DC0                   3998
#define PWM6DCL_PWMPW0                3999
#define PWM6DC0                       4000
#define PWM6DCL_DC1                   4001
#define PWM6DCL_PWMPW1                4002
#define PWM6DC1                       4003
#define PWM6DCH                       4004
#define PWM6DCH_DC2                   4005
#define PWM6DCH_DC                    4006
#define PWM6DCH_PWMPW2                4007
#define PWM6DC2                       4008
#define PWM6DCH_DC3                   4009
#define PWM6DCH_PWMPW3                4010
#define PWM6DC3                       4011
#define PWM6DCH_DC4                   4012
#define PWM6DCH_PWMPW4                4013
#define PWM6DC4                       4014
#define PWM6DCH_DC5                   4015
#define PWM6DCH_PWMPW5                4016
#define PWM6DC5                       4017
#define PWM6DCH_DC6                   4018
#define PWM6DCH_PWMPW6                4019
#define PWM6DC6                       4020
#define PWM6DCH_DC7                   4021
#define PWM6DCH_PWMPW7                4022
#define PWM6DC7                       4023
#define PWM6DCH_DC8                   4024
#define PWM6DC8                       4025
#define PWM6DCH_PWMPW8                4026
#define PWM6DCH_DC9                   4027
#define PWM6DC9                       4028
#define PWM6DCH_PWMPW9                4029
#define PWM6CON                       4030
#define PWM6POL                       4031
#define PWM6CON_POL                   4032
#define PWM6OUT                       4033
#define PWM6CON_OUT                   4034
#define PWM6CON_OE                    4035
#define PWM6OE                        4036
#define PWM6CON_EN                    4037
#define PWM6EN                        4038
#define CCPR2L                        4039
#define CCPR2L_RL                     4040
#define CCPR2H                        4041
#define CCPR2H_RH                     4042
#define CCP2CON                       4043
#define CCP2MODE                      4044
#define CCP2MODE0                     4045
#define CCP2CON_MODE0                 4046
#define CCP2CON_MODE                  4047
#define CCP2MODE1                     4048
#define CCP2CON_MODE1                 4049
#define CCP2MODE2                     4050
#define CCP2CON_MODE2                 4051
#define CCP2MODE3                     4052
#define CCP2CON_MODE3                 4053
#define CCP2FMT                       4054
#define CCP2CON_FMT                   4055
#define CCP2OUT                       4056
#define CCP2CON_OUT                   4057
#define CCP2EN                        4058
#define CCP2CON_EN                    4059
#define CCP2CAP                       4060
#define CCP2CAP_CTS                   4061
#define CCP2CAP_CTS0                  4062
#define CCP2CTS                       4063
#define CCP2CTS0                      4064
#define CCP2CAP_CTS1                  4065
#define CCP2CTS1                      4066
#define CCPR1L                        4067
#define CCPR1L_RL                     4068
#define CCPR1H                        4069
#define CCPR1H_RH                     4070
#define CCP1CON                       4071
#define CCP1MODE0                     4072
#define CCP1CON_MODE0                 4073
#define CCP1CON_MODE                  4074
#define CCP1MODE                      4075
#define CCP1MODE1                     4076
#define CCP1CON_MODE1                 4077
#define CCP1MODE2                     4078
#define CCP1CON_MODE2                 4079
#define CCP1MODE3                     4080
#define CCP1CON_MODE3                 4081
#define CCP1FMT                       4082
#define CCP1CON_FMT                   4083
#define CCP1CON_OUT                   4084
#define CCP1OUT                       4085
#define CCP1EN                        4086
#define CCP1CON_EN                    4087
#define P1M1                          4088
#define CCP1CAP                       4089
#define CCP1CTS0                      4090
#define CCP1CAP_CTS                   4091
#define CCP1CAP_CTS0                  4092
#define CCP1CTS                       4093
#define CCP1CTS1                      4094
#define CCP1CAP_CTS1                  4095
#define CCPTMRS0                      4096
#define C1TSEL0                       4097
#define C1TSEL1                       4098
#define C2TSEL0                       4099
#define C2TSEL1                       4100
#define C3TSEL0                       4101
#define C3TSEL1                       4102
#define C4TSEL0                       4103
#define C4TSEL1                       4104
#define CCPTMRS1                      4105
#define C5TSEL0                       4106
#define C5TSEL1                       4107
#define P6TSEL0                       4108
#define P6TSEL1                       4109
#define P7TSEL0                       4110
#define P7TSEL1                       4111
#define T6TMR                         4112
#define TMR6                          4113
#define T6TMR_TMR                     4114
#define T6PR_PR                       4115
#define T6PR                          4116
#define T6CON                         4117
#define T6CON_OUTPS0                  4118
#define T6OUTPS                       4119
#define T6CON_OUTPS                   4120
#define T6OUTPS0                      4121
#define T6CON_OUTPS1                  4122
#define T6OUTPS1                      4123
#define T6CON_OUTPS2                  4124
#define T6OUTPS2                      4125
#define T6CON_OUTPS3                  4126
#define T6OUTPS3                      4127
#define T6CON_CKPS0                   4128
#define T6CKPS                        4129
#define T6CKPS0                       4130
#define T6CON_CKPS                    4131
#define T6CON_CKPS1                   4132
#define T6CKPS1                       4133
#define T6CON_CKPS2                   4134
#define T6CKPS2                       4135
#define TMR6ON                        4136
#define T6ON                          4137
#define T6CON_ON                      4138
#define T6HLT                         4139
#define T6HLT_MODE0                   4140
#define T6HLT_MODE                    4141
#define T6MODE0                       4142
#define T6MODE                        4143
#define T6HLT_MODE1                   4144
#define T6MODE1                       4145
#define T6MODE2                       4146
#define T6HLT_MODE2                   4147
#define T6HLT_MODE3                   4148
#define T6MODE3                       4149
#define T6MODE4                       4150
#define T6HLT_MODE4                   4151
#define T6CKSYNC                      4152
#define T6HLT_CKSYNC                  4153
#define T6CKPOL                       4154
#define T6HLT_CKPOL                   4155
#define T6PSYNC                       4156
#define T6HLT_PSYNC                   4157
#define T6CLKCON                      4158
#define T6CS                          4159
#define T6CLKCON_CS                   4160
#define T6CLKCON_CS0                  4161
#define T6CS0                         4162
#define T6CLKCON_CS1                  4163
#define T6CS1                         4164
#define T6CLKCON_CS2                  4165
#define T6CS2                         4166
#define T6CLKCON_CS3                  4167
#define T6CS3                         4168
#define T6RST                         4169
#define T6RST_RSEL                    4170
#define T6RST_RSEL0                   4171
#define T6RSEL                        4172
#define T6RSEL0                       4173
#define T6RST_RSEL1                   4174
#define T6RSEL1                       4175
#define T6RSEL2                       4176
#define T6RST_RSEL2                   4177
#define T6RST_RSEL3                   4178
#define T6RSEL3                       4179
#define T4TMR                         4180
#define TMR4                          4181
#define T4TMR_TMR                     4182
#define T4PR_PR                       4183
#define T4PR                          4184
#define T4CON                         4185
#define T4OUTPS0                      4186
#define T4CON_OUTPS                   4187
#define T4OUTPS                       4188
#define T4CON_OUTPS0                  4189
#define T4OUTPS1                      4190
#define T4CON_OUTPS1                  4191
#define T4CON_OUTPS2                  4192
#define T4OUTPS2                      4193
#define T4OUTPS3                      4194
#define T4CON_OUTPS3                  4195
#define T4CON_CKPS0                   4196
#define T4CKPS0                       4197
#define T4CON_CKPS                    4198
#define T4CKPS                        4199
#define T4CKPS1                       4200
#define T4CON_CKPS1                   4201
#define T4CKPS2                       4202
#define T4CON_CKPS2                   4203
#define T4ON                          4204
#define T4CON_ON                      4205
#define TMR4ON                        4206
#define T4HLT                         4207
#define T4MODE                        4208
#define T4HLT_MODE                    4209
#define T4HLT_MODE0                   4210
#define T4MODE0                       4211
#define T4HLT_MODE1                   4212
#define T4MODE1                       4213
#define T4HLT_MODE2                   4214
#define T4MODE2                       4215
#define T4HLT_MODE3                   4216
#define T4MODE3                       4217
#define T4HLT_MODE4                   4218
#define T4MODE4                       4219
#define T4HLT_CKSYNC                  4220
#define T4CKSYNC                      4221
#define T4HLT_CKPOL                   4222
#define T4CKPOL                       4223
#define T4HLT_PSYNC                   4224
#define T4PSYNC                       4225
#define T4CLKCON                      4226
#define T4CS                          4227
#define T4CLKCON_CS                   4228
#define T4CS0                         4229
#define T4CLKCON_CS0                  4230
#define T4CS1                         4231
#define T4CLKCON_CS1                  4232
#define T4CS2                         4233
#define T4CLKCON_CS2                  4234
#define T4CS3                         4235
#define T4CLKCON_CS3                  4236
#define T4RST                         4237
#define T4RSEL0                       4238
#define T4RSEL                        4239
#define T4RST_RSEL                    4240
#define T4RST_RSEL0                   4241
#define T4RSEL1                       4242
#define T4RST_RSEL1                   4243
#define T4RSEL2                       4244
#define T4RST_RSEL2                   4245
#define T4RSEL3                       4246
#define T4RST_RSEL3                   4247
#define T2TMR                         4248
#define TMR2                          4249
#define T2TMR_TMR                     4250
#define T2PR                          4251
#define T2PR_PR                       4252
#define T2CON                         4253
#define T2OUTPS0                      4254
#define T2CON_OUTPS0                  4255
#define T2OUTPS                       4256
#define T2CON_OUTPS                   4257
#define T2OUTPS1                      4258
#define T2CON_OUTPS1                  4259
#define T2OUTPS2                      4260
#define T2CON_OUTPS2                  4261
#define T2OUTPS3                      4262
#define T2CON_OUTPS3                  4263
#define T2CKPS0                       4264
#define T2CON_CKPS                    4265
#define T2CKPS                        4266
#define T2CON_CKPS0                   4267
#define T2CKPS1                       4268
#define T2CON_CKPS1                   4269
#define T2CKPS2                       4270
#define T2CON_CKPS2                   4271
#define T2CON_ON                      4272
#define TMR2ON                        4273
#define T2ON                          4274
#define T2HLT                         4275
#define T2HLT_MODE                    4276
#define T2MODE                        4277
#define T2MODE0                       4278
#define T2HLT_MODE0                   4279
#define T2MODE1                       4280
#define T2HLT_MODE1                   4281
#define T2MODE2                       4282
#define T2HLT_MODE2                   4283
#define T2MODE3                       4284
#define T2HLT_MODE3                   4285
#define T2MODE4                       4286
#define T2HLT_MODE4                   4287
#define T2HLT_CKSYNC                  4288
#define T2CKSYNC                      4289
#define T2HLT_CKPOL                   4290
#define T2CKPOL                       4291
#define T2PSYNC                       4292
#define T2HLT_PSYNC                   4293
#define T2CLKCON                      4294
#define T2CS                          4295
#define T2CS0                         4296
#define T2CLKCON_CS                   4297
#define T2CLKCON_CS0                  4298
#define T2CS1                         4299
#define T2CLKCON_CS1                  4300
#define T2CS2                         4301
#define T2CLKCON_CS2                  4302
#define T2CS3                         4303
#define T2CLKCON_CS3                  4304
#define T2RST                         4305
#define T2RSEL0                       4306
#define T2RST_RSEL                    4307
#define T2RSEL                        4308
#define T2RST_RSEL0                   4309
#define T2RSEL1                       4310
#define T2RST_RSEL1                   4311
#define T2RST_RSEL2                   4312
#define T2RSEL2                       4313
#define T2RSEL3                       4314
#define T2RST_RSEL3                   4315
#define TMR5L                         4316
#define TMR5L0                        4317
#define TMR5L1                        4318
#define TMR5L2                        4319
#define TMR5L3                        4320
#define TMR5L4                        4321
#define TMR5L5                        4322
#define TMR5L6                        4323
#define TMR5L7                        4324
#define TMR5H0                        4325
#define TMR5H                         4326
#define TMR5H1                        4327
#define TMR5H2                        4328
#define TMR5H3                        4329
#define TMR5H4                        4330
#define TMR5H5                        4331
#define TMR5H6                        4332
#define TMR5H7                        4333
#define T5CON                         4334
#define T5CON_ON                      4335
#define TMR5ON                        4336
#define T5CON_RD16                    4337
#define T5RD16                        4338
#define RD165                         4339
#define nT5SYNC                       4340
#define T5CON_nSYNC                   4341
#define T5CON_NOT_SYNC                4342
#define NOT_T5SYNC                    4343
#define T5CON_CKPS0                   4344
#define T5CON_CKPS                    4345
#define T5CKPS0                       4346
#define T5CON_CKPS1                   4347
#define T5CKPS1                       4348
#define T5GCON                        4349
#define T5GCON_GVAL                   4350
#define T5GVAL                        4351
#define T5GGO_nDONE                   4352
#define T5GCON_GGO_NOT_DONE           4353
#define T5GCON_GGO_nDONE              4354
#define T5GGO_NOT_DONE                4355
#define T5GGO                         4356
#define T5GCON_GSPM                   4357
#define T5GSPM                        4358
#define T5GTM                         4359
#define T5GCON_GTM                    4360
#define T5GPOL                        4361
#define T5GCON_GPOL                   4362
#define T5GCON_GE                     4363
#define T5GE                          4364
#define T5GATE                        4365
#define T5GATE_GSS0                   4366
#define T5GSS0                        4367
#define T5GATE_GSS                    4368
#define T5GATE_GSS1                   4369
#define T5GSS1                        4370
#define T5GATE_GSS2                   4371
#define T5GSS2                        4372
#define T5GATE_GSS3                   4373
#define T5GSS3                        4374
#define T5CLK                         4375
#define T5CS0                         4376
#define T5CLK_CS                      4377
#define T5CLK_CS0                     4378
#define T5CS1                         4379
#define T5CLK_CS1                     4380
#define T5CS2                         4381
#define T5CLK_CS2                     4382
#define T5CS3                         4383
#define T5CLK_CS3                     4384
#define TMR3L0                        4385
#define TMR3L                         4386
#define TMR3L1                        4387
#define TMR3L2                        4388
#define TMR3L3                        4389
#define TMR3L4                        4390
#define TMR3L5                        4391
#define TMR3L6                        4392
#define TMR3L7                        4393
#define TMR3H                         4394
#define TMR3H0                        4395
#define TMR3H1                        4396
#define TMR3H2                        4397
#define TMR3H3                        4398
#define TMR3H4                        4399
#define TMR3H5                        4400
#define TMR3H6                        4401
#define TMR3H7                        4402
#define T3CON                         4403
#define T3CON_ON                      4404
#define TMR3ON                        4405
#define T3CON_RD16                    4406
#define RD163                         4407
#define T3RD16                        4408
#define T3CON_NOT_SYNC                4409
#define T3CON_nSYNC                   4410
#define NOT_T3SYNC                    4411
#define nT3SYNC                       4412
#define T3CKPS0                       4413
#define T3CON_CKPS0                   4414
#define T3CON_CKPS                    4415
#define T3CKPS1                       4416
#define T3CON_CKPS1                   4417
#define T3GCON                        4418
#define T3GVAL                        4419
#define T3GCON_GVAL                   4420
#define T3GGO                         4421
#define T3GGO_NOT_DONE                4422
#define T3GCON_GGO_nDONE              4423
#define T3GGO_nDONE                   4424
#define T3GCON_GGO_NOT_DONE           4425
#define T3GCON_GSPM                   4426
#define T3GSPM                        4427
#define T3GCON_GTM                    4428
#define T3GTM                         4429
#define T3GCON_GPOL                   4430
#define T3GPOL                        4431
#define T3GCON_GE                     4432
#define T3GE                          4433
#define T3GATE                        4434
#define T3GSS0                        4435
#define T3GATE_GSS0                   4436
#define T3GATE_GSS                    4437
#define T3GSS1                        4438
