tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf67k40_tdd.h
#define T3GATE_GSS1                   4439
#define T3GSS2                        4440
#define T3GATE_GSS2                   4441
#define T3GSS3                        4442
#define T3GATE_GSS3                   4443
#define T3CLK                         4444
#define T3CLK_CS                      4445
#define T3CLK_CS0                     4446
#define T3CS0                         4447
#define T3CLK_CS1                     4448
#define T3CS1                         4449
#define T3CLK_CS2                     4450
#define T3CS2                         4451
#define T3CS3                         4452
#define T3CLK_CS3                     4453
#define TMR1L                         4454
#define TMR1L0                        4455
#define TMR1L1                        4456
#define TMR1L2                        4457
#define TMR1L3                        4458
#define TMR1L4                        4459
#define TMR1L5                        4460
#define TMR1L6                        4461
#define TMR1L7                        4462
#define TMR1H0                        4463
#define TMR1H                         4464
#define TMR1H1                        4465
#define TMR1H2                        4466
#define TMR1H3                        4467
#define TMR1H4                        4468
#define TMR1H5                        4469
#define TMR1H6                        4470
#define TMR1H7                        4471
#define T1CON                         4472
#define TMR1ON                        4473
#define T1CON_ON                      4474
#define T1CON_RD16                    4475
#define T1RD16                        4476
#define NOT_T1SYNC                    4477
#define T1CON_nSYNC                   4478
#define nT1SYNC                       4479
#define T1CON_NOT_SYNC                4480
#define T1CON_CKPS0                   4481
#define T1CKPS0                       4482
#define T1CON_CKPS                    4483
#define T1CKPS1                       4484
#define T1CON_CKPS1                   4485
#define T1GCON                        4486
#define T1GCON_GVAL                   4487
#define T1GVAL                        4488
#define T1GGO_NOT_DONE                4489
#define T1GGO_nDONE                   4490
#define T1GCON_GGO_nDONE              4491
#define T1GCON_GGO_NOT_DONE           4492
#define T1GGO                         4493
#define T1GCON_GSPM                   4494
#define T1GSPM                        4495
#define T1GTM                         4496
#define T1GCON_GTM                    4497
#define T1GPOL                        4498
#define T1GCON_GPOL                   4499
#define T1GCON_GE                     4500
#define T1GE                          4501
#define T1GATE                        4502
#define T1GATE_GSS0                   4503
#define T1GSS0                        4504
#define T1GATE_GSS                    4505
#define T1GATE_GSS1                   4506
#define T1GSS1                        4507
#define T1GSS2                        4508
#define T1GATE_GSS2                   4509
#define T1GSS3                        4510
#define T1GATE_GSS3                   4511
#define T1CLK                         4512
#define T1CS0                         4513
#define T1CLK_CS                      4514
#define T1CLK_CS0                     4515
#define T1CLK_CS1                     4516
#define T1CS1                         4517
#define T1CS2                         4518
#define T1CLK_CS2                     4519
#define T1CS3                         4520
#define T1CLK_CS3                     4521
#define TMR0L0                        4522
#define TMR0L                         4523
#define TMR0L1                        4524
#define TMR0L2                        4525
#define TMR0L3                        4526
#define TMR0L4                        4527
#define TMR0L5                        4528
#define TMR0L6                        4529
#define TMR0L7                        4530
#define TMR0H0                        4531
#define T0PR                          4532
#define TMR0H                         4533
#define T0PR0                         4534
#define TMR0H1                        4535
#define T0PR1                         4536
#define TMR0H2                        4537
#define T0PR2                         4538
#define TMR0H3                        4539
#define T0PR3                         4540
#define TMR0H4                        4541
#define T0PR4                         4542
#define TMR0H5                        4543
#define T0PR5                         4544
#define TMR0H6                        4545
#define T0PR6                         4546
#define TMR0H7                        4547
#define T0PR7                         4548
#define T0CON0                        4549
#define T0OUTPS                       4550
#define T0OUTPS0                      4551
#define T0OUTPS1                      4552
#define T0OUTPS2                      4553
#define T0OUTPS3                      4554
#define T016BIT                       4555
#define T0OUT                         4556
#define T0EN                          4557
#define T0CON1                        4558
#define T0PS                          4559
#define T0CKPS                        4560
#define T0CKPS0                       4561
#define T0PS0                         4562
#define T0CKPS1                       4563
#define T0PS1                         4564
#define T0CKPS2                       4565
#define T0PS2                         4566
#define T0CKPS3                       4567
#define T0PS3                         4568
#define T0ASYNC                       4569
#define T0CS                          4570
#define T0CS0                         4571
#define T0CS1                         4572
#define T0CS2                         4573
#define PCON0                         4574
#define BOR                           4575
#define NOT_BOR                       4576
#define nBOR                          4577
#define POR                           4578
#define nPOR                          4579
#define NOT_POR                       4580
#define nRI                           4581
#define NOT_RI                        4582
#define RI                            4583
#define NOT_RMCLR                     4584
#define nRMCLR                        4585
#define RMCLR                         4586
#define NOT_RWDT                      4587
#define nRWDT                         4588
#define RWDT                          4589
#define nWDTWV                        4590
#define WDTWV                         4591
#define NOT_WDTWV                     4592
#define STKUNF                        4593
#define STKOVF                        4594
#define STATUS                        4595
#define C                             4596
#define CARRY                         4597
#define STATUS_DC                     4598
#define ZERO                          4599
#define Z                             4600
#define OV                            4601
#define OVERFLOW                      4602
#define N                             4603
#define NEGATIVE                      4604
#define PD                            4605
#define nPD                           4606
#define NOT_PD                        4607
#define TO                            4608
#define NOT_TO                        4609
#define nTO                           4610
#define FSR2L                         4611
#define PLUSW2                        4612
#define PREINC2                       4613
#define POSTDEC2                      4614
#define POSTINC2                      4615
#define INDF2                         4616
#define FSR1L                         4617
#define PLUSW1                        4618
#define PREINC1                       4619
#define POSTDEC1                      4620
#define POSTINC1                      4621
#define INDF1                         4622
#define WREG                          4623
#define FSR0L                         4624
#define PLUSW0                        4625
#define PREINC0                       4626
#define POSTDEC0                      4627
#define POSTINC0                      4628
#define INDF0                         4629
#define INTCON                        4630
#define INT0EDG                       4631
#define INT1EDG                       4632
#define INT2EDG                       4633
#define INT3EDG                       4634
#define IPEN                          4635
#define PEIE                          4636
#define PEIE_GIEL                     4637
#define GIEL                          4638
#define GIE                           4639
#define GIE_GIEH                      4640
#define GIEH                          4641
#define PRODL                         4642
#define PRODH                         4643
#define TABLAT                        4644
#define TBLPTRL                       4645
#define TBLPTRH                       4646
#define TBLPTRU                       4647
#define ACSS                          4648
#define PCL                           4649
#define PCLATH                        4650
#define PCLATH_PCH                    4651
#define PCLATU                        4652
#define PCU                           4653
#define STKPTR0                       4654
#define STKPTR                        4655
#define SP0                           4656
#define STKPTR1                       4657
#define SP1                           4658
#define STKPTR2                       4659
#define SP2                           4660
#define SP3                           4661
#define STKPTR3                       4662
#define STKPTR4                       4663
#define SP4                           4664
#define STKPTR5                       4665
#define SP5                           4666
#define TOSL                          4667
#define TOSH                          4668

#endif // _PIC18LF67K40_H_
